{
  "posts": [
    {
      "id": 1,
      "title": "Bald Eagle",
      "image": "https://cdn.newsapi.com.au/image/v1/3370f74c7ece60ef21e332ad703f5802",
      "description": "The Bald Eagle has been the national emblem of the United States since 1782 and a spiritual symbol for native people for far longer than that. These regal birds aren’t really bald, but their white-feathered heads gleam in contrast to their chocolate-brown body and wings. Once endangered by hunting and pesticides, Bald Eagles have flourished under protection.",
      "article": "The bald eagle is not picky about how it gets its food. It will eat carrion, steal fish from other birds or hunt for its own. Their most important non-carrion food is fish, which they catch by swooping down and grabbing fish that are near the surface of the lake or stream. Bald eagles make a high-pitched squeaking sound. Other interesting behaviors include “talon clasping” or “cartwheel display”, where two eagles clasp each other’s talons in mid air and spin down, letting go only when they’ve almost reached the ground. This is may be a courtship ritual as well as a territorial battle. During breeding season, the male and female work together to build a nest of sticks, usually located at the top of a tree. The nests can weigh up to a ton and measure up to 8 feet across. Once paired, bald eagles remain with each other until one mate dies, then the surviving bird will find another mate.",
      "liked": false,
      "bookmarked": false,
      "disliked": false
    },
    {
      "id": 2,
      "title": "White Tiger",
      "image": "https://upload.wikimedia.org/wikipedia/commons/a/a4/White-tiger-2407799_1280.jpg",
      "description": "The white tiger or bleached tiger is a pigmentation variant of the Bengal tiger, which is reported in the wild from time to time in the Indian states of Madhya Pradesh, Assam, West Bengal and Bihar in the Sunderbans region and especially in the former State of Rewa.[1] Such a tiger has the black stripes typical of the Bengal tiger, but carries a white or near-white coat.",
      "article": "The white Bengal tigers are distinctive due to the color of their fur. The white fur caused by a lack of the pigment pheomelanin, which is found in Bengal tigers with orange color fur. When compared to Bengal tigers, the white Bengal tigers tend to grow faster and heavier than the orange Bengal tiger. They also tend to be somewhat bigger at birth, and as fully grown adults. White Bengal tigers are fully grown when they are 2–3 years of age. White male tigers reach weights of 200 to 230 kilograms and can grow up to 3 meters in length. As with all tigers, the white Bengal tiger’s stripes are like fingerprints, with no two tigers having the same pattern. The stripes of the tiger are a pigmentation of the skin; if an individual were to be shaved, its distinctive coat pattern would still be visible. \n\n For a white Bengal tiger to be born, both parents must carry the unusual gene for white colouring, which only happens naturally about once in 10,000 births.[2] Dark-striped white individuals are well-documented in the Bengal tiger subspecies (Panthera tigris tigris) as well as having been reported historically in several other subspecies.[2] Currently, several hundred white tigers are in captivity worldwide, with about one hundred being found in India. Their unique white color fur has made them popular in entertainment showcasing exotic animals, and at zoos.",
      "liked": false,
      "bookmarked": false,
      "disliked": false
    },
    {
      "id": 3,
      "title": "Gharial",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/20/Mother_and_Chilld.jpg/800px-Mother_and_Chilld.jpg",
      "description": "The gharial (Gavialis gangeticus), also known as the gavial, and fish-eating crocodile is a crocodilian in the family Gavialidae, and is native to the northern part of the Indian subcontinent.[3] The global wild gharial population is estimated at fewer than 235 individuals, which are threatened by loss of riverine habitat, depletion of fish resources, and entanglement in fishing nets. As the population has declined drastically since the 1930s, the gharial is listed as Critically Endangered on the IUCN Red List. It once inhabited all the major river systems of the Indian subcontinent, from the Indus River in the west to the Irrawaddy River in the east. Its distribution is now limited to only 2% of its historical range. It inhabits foremost flowing rivers with high sand banks that it uses for basking and building nests.",
      "article": "Gharial hatchlings are pale olive on the back and become darker with age. Dark cross-bands and speckles are visible on head, body and tail. Scutes on head, neck and back form a single continuous plate composed of 21 to 22 transverse series, and four longitudinal series. Scutes on the back are bony, but softer and feebly keeled on the sides. The outer edges of the forearms, legs, and feet are crested, and fingers and toes partly webbed. The gharial's belly is yellowish-white, its neck long and thick. There are two rows of ridges on the central region of the back. Male gharials develop a hollow bulbous nasal protuberance at the tip of the snout upon sexual maturity. This nasal growth starts growing over the nostrils at an age of 11.5 years and measures about 5 cm × 6 cm × 3.5 cm (2.0 in × 2.4 in × 1.4 in) at an age of 15.5 years, and enables the males to emit a hissing sound that can be heard at a distance of 75 m (246 ft).[16] It resembles an earthen pot known locally as 'ghara'.[3] The nasal growth is apparently used to indicate sexual maturity, as sound resonator when bubbling under water or other sexual behaviours. The gharial is the only living crocodilian with such visible sexual dimorphism. The gharial's snout is very long and narrow, with 27 to 29 upper and 25 or 26 lower teeth on each side. The front teeth are the largest. The first, second, and third mandibular teeth fit into notches in the upper jaw. The nasal bones are rather short and widely separated from the premaxilla. The nasal opening is smaller than the supratemporal fossae. The jugal bone is raised and the extremely long symphysis extends to the 23rd or 24th tooth. The snout is dilated at the end.[14] It becomes proportionally thicker with age.[4] This long snout is considered an adaptation to a primarily piscivorous diet.[3] The long, needle-like teeth are individually socketed. The tail is well-developed and laterally flattened. Together with the webbed feet it provides tremendous manoeuvrability in deep water. On land, a gharial can only slide on its belly and push itself forward.",
      "liked": false,
      "bookmarked": false,
      "disliked": false
    }
  ]
}
